
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьВДерево(Метаданные.РегистрыСведений, "РегистрыСведений", "РегистрСведений");
	ДобавитьВДерево(Метаданные.РегистрыНакопления, "РегистрыНакопления", "РегистрНакопления");
	ДобавитьВДерево(Метаданные.РегистрыБухгалтерии, "РегистрыБухгалтерии", "РегистрБухгалтерии");
	ДобавитьВДерево(Метаданные.РегистрыРасчета, "РегистрыРасчета", "РегистрРасчета");
	           
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДерево(КоллекцияМетаданных, ИмяМенеджера, ИмяЭлемента)
	
	СтрокаДерева = Дерево.ПолучитьЭлементы().Добавить();
	
	СтрокаДерева.Имя = ИмяМенеджера;
	СтрокаДерева.ИмяЭлемента = ИмяЭлемента;
	СтрокаДерева.Уровень = 0;
	
	Для Каждого элем Из КоллекцияМетаданных Цикл
		
		ПодчиненнаяСтрока = СтрокаДерева.ПолучитьЭлементы().Добавить();
		
		ПодчиненнаяСтрока.Имя = элем.Имя;
		ПодчиненнаяСтрока.ИмяЭлемента = ИмяЭлемента;
		ПодчиненнаяСтрока.Уровень = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Строка = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	_Родитель = Строка.ПолучитьРодителя();
	
	Если _Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("ИмяТипа", Строка.Имя); 
	СтруктураВозврата.Вставить("ИмяМенеджера", _Родитель.Имя + "." + Строка.Имя); 
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры


