
&НаКлиенте
Процедура ДобавитьГород(Команда)
	ДобавитьГородНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьГородНаСервере()
	
	ОбъектСправочника = Справочники.Города.СоздатьЭлемент();
	ОбъектСправочника.УстановитьНовыйКод();
	ОбъектСправочника.Наименование = Наименование;
	ОбъектСправочника.Округ = Округ;
	ОбъектСправочника.Численность = Численность;
	
	Попытка
		ОбъектСправочника.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиГород(Команда)
	НайтиГородНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиГородНаСервере()
	
	Если ПустаяСтрока(НаименованиеДляПоиска) Тогда
		Сообщить("Заполните наименование для поиска!");
		Возврат;
	КонецЕсли;
	
	СсылкаНайденногоГорода = Справочники.Города.НайтиПоНаименованию(НаименованиеДляПоиска);
	СсылкаМосква = Справочники.Города.Москва;
	
	Сообщить("" + СсылкаНайденногоГорода + " | " + СсылкаНайденногоГорода.Численность);
	Сообщить("" + СсылкаМосква + " | " + СсылкаМосква.Численность);

КонецПроцедуры
