
&НаКлиенте
Процедура СоставSNПриИзменении(Элемент)
	
	ТекущиеДан = Элементы.Состав.ТекущиеДанные;
	РезультатПроверки = ПроверкаСН(ТекущиеДан.SN); 
	
	Если Не РезультатПроверки.Проверка Тогда
		ТекущиеДан.Номенклатура = РезультатПроверки.Номенклатура;
		ТекущиеДан.Номинал = РезультатПроверки.Номинал;
	КонецЕсли;
		
	Для Каждого Строка из Объект.Состав Цикл
		Если Строка.SN = ТекущиеДан.SN И ТекущиеДан.НомерСтроки <> Строка.НомерСтроки Тогда
			Сообщить("Данная карта уже используется");
			ТекущиеДан.SN = "";
			Возврат
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
	
	КонецПроцедуры
	
&НаКлиенте
Процедура СоставСуммаСписанияПриИзменении(Элемент)
	
	Объект.Сумма = Объект.Состав.Итог("СуммаСписания");
	
КонецПроцедуры

&НаСервере
Функция ПроверкаСН(СН)  
	
	СтруктураСН = Новый Структура;
	ЗапросСН = Новый Запрос("ВЫБРАТЬ
	|	БалансПодарочнойКарты.Номенклатура КАК Номенклатура,
	|	БалансПодарочнойКарты.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.БалансПодарочнойКарты КАК БалансПодарочнойКарты
	|ГДЕ
	|	БалансПодарочнойКарты.SN = &SN");
	
	ЗапросСН.УстановитьПараметр("SN",СН);
	
	ТаблицаСН = ЗапросСН.Выполнить().Выгрузить();
	Если ТаблицаСН.Количество() > 1 Тогда
		Сообщить("Продажа по этой карте уже проводилась");
		СтруктураСН.Вставить("Проверка",Истина);
		Возврат СтруктураСН
	ИначеЕсли ТаблицаСН.Количество() = 0 Тогда
		Сообщить("Карты не найдено");
		СтруктураСН.Вставить("Проверка",Истина);
		Возврат СтруктураСН
	Иначе
		СтрокаТЗ = ТаблицаСН[0];
		СтруктураСН.Вставить("Проверка",Ложь);
		СтруктураСН.Вставить("Номенклатура",СтрокаТЗ.Номенклатура);
		СтруктураСН.Вставить("Номинал",СтрокаТЗ.Сумма);
		Возврат СтруктураСН
	КонецЕсли;
	
КонецФункции

