&НаКлиенте
Процедура СоставЦенаИЛИКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	КонецЕсли;
	ПересчитатьСуммуДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Состав.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоставНоменклатураПриИзмененииНаСервере(ДокументОснование, Номенклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаказанныеТоварыОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ЗаказанныеТовары.Остатки(, Заказ = &Заказ) КАК ЗаказанныеТоварыОстатки");
	Запрос.УстановитьПараметр("Заказ", ДокументОснование);
	ТаблицаЗароса = Запрос.Выполнить().Выгрузить();
	НайденнаяСтрока = ТаблицаЗароса.Найти(Номенклатура,"Номенклатура");
	
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Истина 
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если СоставНоменклатураПриИзмененииНаСервере(Объект.ДокументОснование, ТекДанные.Номенклатура) Тогда
		Сообщить("Товар " + ТекДанные.Номенклатура + " не был заказан, либо принят получателем");
		ТекДанные.Номенклатура = "";
	КонецЕсли;
	
	КонецПроцедуры
