
&НаСервере
Процедура ИспользоватьМВТНаСервере()
	
	МВТ = Новый МенеджерВременныхТаблиц;
	ЗаполнитьМВТ(МВТ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМВТ(Команда)
	ИспользоватьМВТНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМВТ(МВТ)
	
	ЗапросНоменклатуры = Новый Запрос;
	ЗапросНоменклатуры.МенеджерВременныхТаблиц = МВТ;
	ЗапросНоменклатуры.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТовараОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТовараОстатки.Филиал КАК Филиал,
	|	ОстаткиТовараОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиТовараОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки КАК ОстаткиТовараОстатки
	|ГДЕ
	|	ОстаткиТовараОстатки.КоличествоОстаток > 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Ссылка КАК Ссылка
	|ИЗ
	|	втТовары КАК втТовары";
	
	ЗапросНоменклатуры.Выполнить(); 
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьМВТСОбходомНаСервере()
	
	МВТ = Новый МенеджерВременныхТаблиц;
	ЗаполнитьМВТ(МВТ);
	
	Для Каждого ВременнаяТаблица из МВТ.Таблицы Цикл
		Сообщить("Таблица = "+ ВременнаяТаблица.ПолноеИмя);
		ДанныеВТ = ВременнаяТаблица.ПолучитьДанные().Выгрузить();
		Сообщить("Строка в таблице = "+ Строка(ДанныеВТ.Количество()));
		Сообщить("Колонки в таблице:");
		
		Для Каждого КолонкаВТ из ВременнаяТаблица.Колонки Цикл
			Сообщить("Имя колонки: " + КолонкаВТ.Имя + ". Тип значения в колонке: " + Строка(КолонкаВТ.ТипЗначения));
		КонецЦикла;
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМВТСОбходом(Команда)
	ИспользоватьМВТСОбходомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьМВТСЗапросомНаСервере()
	
	МВТ = Новый МенеджерВременныхТаблиц;
ЗаполнитьМВТ(МВТ);
Запрос = Новый Запрос;
Запрос.МенеджерВременныхТаблиц = МВТ;
//Получим ТЗ из временной таблицы
ОстаткиТовара = МВТ.Таблицы[1].ПолучитьДанные().Выгрузить();

//Выполним изменения ТЗ
Для Каждого СтрокаТЗ Из ОстаткиТовара Цикл 
СтрокаТЗ.СуммаОстаток = СтрокаТЗ.СуммаОстаток + 100;
КонецЦикла;

//Добавим ТЗ в запрос и поместим во Временную таблицу вт_ОстаткиПересчитанные
Запрос.Текст = "ВЫБРАТЬ
|	тзОстаткиТовара.Номенклатура КАК Номенклатура,
|	тзОстаткиТовара.СуммаОстаток КАК СуммаОстаток
|Поместить вт_ОстаткиПересчитанные
|	ИЗ
|	&ОстаткиТовара КАК тзОстаткиТовара
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	КОЛИЧЕСТВО(*) КАК Количество
|ИЗ
|	втТовары КАК втТовары";

//Передадим ТЗ как параметр
Запрос.УстановитьПараметр("ОстаткиТовара", ОстаткиТовара);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
Сообщить("Строк в таблице втТовары = " + Строка(Выборка.Количество));
КонецЕсли;

МВТ.Закрыть();

	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМВТСЗапросом(Команда)
	ИспользоватьМВТСЗапросомНаСервере();
КонецПроцедуры


 
