
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если (ЭтотОбъект.Параметры.РежимПодбора) Тогда
		Выбор = Новый СписокЗначений;
		Выбор.Добавить("Заменить текущий список.");
		Выбор.Добавить("Добавить в конец списка.");
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект, Значение);
		Выбор.ПоказатьВыборЭлемента(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбора(Выбор, ДополнительныеПараметры) Экспорт
	
	СсылкаВыбранныйДокумент = ДополнительныеПараметры;
	СтруктураВыбора = Новый Структура();
	СтруктураВыбора.Вставить("Документ", СсылкаВыбранныйДокумент);
	Если Выбор.Значение = "Заменить текущий список." Тогда
		Сообщить(Выбор);
		Заменить = Истина;
	Иначе
		Заменить = Ложь;
	КонецЕсли;
	СтруктураВыбора.Вставить("Выбор", Заменить);
	СтруктураВыбора.Вставить("ДопЭлемент","1");
	ОповеститьОВыборе(СтруктураВыбора);	
	
КонецПроцедуры 

