
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		// Заполнение шапки
		Автор = ДанныеЗаполнения.Автор;
		Основание = ДанныеЗаполнения.Ссылка;
		Филиал = ДанныеЗаполнения.Филиал;
		ВидЦены = Перечисления.ВидыЦен.Розничная;
		Для Каждого ТекСтрокаНоменклатура Из ДанныеЗаполнения.Номенклатура Цикл
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
			НоваяСтрока.Цена = ТекСтрокаНоменклатура.Сумма * 1.1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
		Движение.Филиал = Филиал;
		Движение.ВидЦены = ВидЦены;
		Движение.Цена = ТекСтрокаСостав.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
