
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПеремещениеТовара.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТовара.Автор,
	|	ПеремещениеТовара.АвторПолучатель,
	|	ПеремещениеТовара.Дата,
	|	ПеремещениеТовара.Номер,
	|	ПеремещениеТовара.ФилиалОтправитель,
	|	ПеремещениеТовара.ФилиалПолучатель,
	|	ПеремещениеТовара.Состав.(
	|		Номенклатура,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПеремещениеТовара КАК ПеремещениеТовара
	|ГДЕ
	|	ПеремещениеТовара.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСостав = Макет.ПолучитьОбласть("Состав");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;                                    
		
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьСоставШапка);
		ВыборкаСостав = Выборка.Состав.Выбрать(); 
		КоличествоИтог = 0;
		СуммаИтог = 0;
		Пока ВыборкаСостав.Следующий() Цикл
			ОбластьСостав.Параметры.Заполнить(ВыборкаСостав);
			ТабДок.Вывести(ОбластьСостав, ВыборкаСостав.Уровень());
			КоличествоИтог = КоличествоИтог + ВыборкаСостав.Количество;
			СуммаИтог = СуммаИтог + ВыборкаСостав.Сумма;
		КонецЦикла;
		
		Подвал.Параметры.Автор = Выборка.Автор.Фамилия + " " + Лев(Выборка.Автор.Имя, 1) + ". " + Лев(Выборка.Автор.Отчество, 1) + ".";
		Подвал.Параметры.АвторПолучатель = Выборка.АвторПолучатель.Фамилия + " " + Лев(Выборка.АвторПолучатель.Имя, 1) + ". " + Лев(Выборка.АвторПолучатель.Отчество, 1) + "."; 
		Подвал.Параметры.СуммаИтог = СуммаИтог;
		Подвал.Параметры.КоличествоИтог = КоличествоИтог;
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
