
&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	ДобавитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере()
	
	ЭлементНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	ЭлементНоменклатура.Наименование 	= Наименование;
	ЭлементНоменклатура.Категория 		= Категория;
	ЭлементНоменклатура.Гарантия 		= Гарантия;
	
	Попытка
		ЭлементНоменклатура.Записать();
	Исключение
		Сообщить("Ошибка при записи элемента справочника ""Номенклатура""");
	КонецПопытки;
	
КонецПроцедуры
