
&НаСервере
Процедура ВывестиСписокТоваровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Код КАК Код,
	               |	Номенклатура.Гарантия КАК Гарантия,
	               |	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура";
	ТаблицаНоменклатура = Запрос.Выполнить().Выгрузить(); 
	Для каждого Строка из ТаблицаНоменклатура Цикл
		Сообщить(Строка.Ссылка);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСписокТоваров(Команда)
	ВывестиСписокТоваровНаСервере();
КонецПроцедуры
