
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СтруктураДляОтчета) <> Тип("Структура") Тогда
		Сообщить("Неверный тип передаваемых данных");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	Заголовок = СтрШаблон("%1 процент прибыли %2", Параметры.СтруктураДляОтчета.Филиал, Параметры.СтруктураДляОтчета.ПроцентПрибыли);
	Филиал = Параметры.СтруктураДляОтчета.Филиал;
	ДатаС = Параметры.СтруктураДляОтчета.ДатаС;
	ДатаПо = Параметры.СтруктураДляОтчета.ДатаПо;

	
КонецПроцедуры
