
&НаСервере
Процедура ДобавитьЗаписьНаСервере()
	
	
	НЗ = РегистрыСведений.ИсторияЮрЛиц.СоздатьНаборЗаписей();
	НЗ.Отбор.ЮрЛицо.Установить(ЮрЛицо);
	НЗ.Отбор.ВидДанных.Установить(ВидДанных);
	НЗ.Отбор.Период.Установить(Период);
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.ЮрЛицо = ЮрЛицо;
	НоваяЗапись.ВидДанных = ВидДанных;
	НоваяЗапись.Данные = Данные;
	НоваяЗапись.Период = Период;
		
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗапись(Команда)
	ДобавитьЗаписьНаСервере();
КонецПроцедуры
