
Процедура ПередЗаписью(Отказ)
	
	Если (Не ЗначениеЗаполнено(ЭтотОбъект.ВидФилиала)) Тогда
		Сообщить("Не заполнен вид филиала!");
		Отказ = Истина;
	КонецЕсли; 
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если (ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый) Тогда
	    ОбъектСклад = Справочники.Склады.СоздатьЭлемент();
	    ОбъектСклад.Владелец = ЭтотОбъект.Ссылка;
	    ОбъектСклад.Наименование = ЭтотОбъект.Наименование + " (Основной)";
	    ОбъектСклад.ТипСклада = Перечисления.ТипыСкладов.Основной;
	    ОбъектСклад.Записать();
	КонецЕсли;  
	
КонецПроцедуры
