
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	ВставитьРазделительСтраниц = Ложь;
Если (Ложь) Тогда
ТабДок = Новый ТабличныйДокумент;
КонецЕсли;

Для Каждого СсылкаНаДокумент из Ссылка Цикл
Если (ВставитьРазделительСтраниц) Тогда 
ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецЕсли;

Макет = Документы.УценкаТовара.ПолучитьМакет("Печать");

ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
ОбластьСостав = Макет.ПолучитьОбласть("Состав");
ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

ОбластьЗаголовок.Параметры.Дата = СсылкаНаДокумент.Дата;
ОбластьЗаголовок.Параметры.НомерДокумента = СсылкаНаДокумент.Номер;

ОбластьШапка.Параметры.Заполнить(СсылкаНаДокумент);

ТабДок.Вывести(ОбластьЗаголовок);
ТабДок.Вывести(ОбластьШапка);
ТабДок.Вывести(ОбластьСоставШапка);

Для Каждого СтрокаСписка Из СсылкаНаДокумент.Состав Цикл
ОбластьСостав.Параметры.Заполнить(СтрокаСписка);
ОбластьСостав.Параметры.РазницаЦен = СтрокаСписка.НоваяЦена - СтрокаСписка.Цена; 
ТабДок.Вывести(ОбластьСостав);
КонецЦикла;

ОбластьПодвал.Параметры.Заполнить(СсылкаНаДокумент);
ТабДок.Вывести(ОбластьПодвал);

ВставлятьРазделительСтраниц = Истина;
КонецЦикла;

КонецПроцедуры
