
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборкаЮЛ = Справочники.ЮридическиеЛица.Выбрать(,,, "Наименование ВОЗР");
	Пока ВыборкаЮЛ.Следующий() Цикл 
		НоваяСтрока = СписокЮЛ.Добавить();
		НоваяСтрока.ЮЛ = ВыборкаЮЛ.Ссылка; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЮЛПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокЮЛ.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		СписокПриАктивизацииСтрокиНаСервере(ТекДанные.ЮЛ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(СсылкаЮЛ)
	
	ПолеКомпоновкиВладелец = Новый ПолеКомпоновкиДанных("Владелец");
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл 
		Если (ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиВладелец) Тогда
			Если (ЭлементОтбора.ПравоеЗначение <> СсылкаЮЛ) Тогда
				ЭлементОтбора.ПравоеЗначение = СсылкаЮЛ;
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = СсылкаЮЛ;

КонецПроцедуры

