
&НаСервере
Процедура КомандаПометкаУдаленияНаСервере()
	
	Если (Объект.Проведен) Тогда
		Сообщить("Запрещено устанавливать пометку на проведенный документ.");
		Возврат;
	КонецЕсли;
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	ОбъектДокумента.УстановитьПометкуУдаления(Истина);
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура КомандаПометкаУдаления(Команда)
	КомандаПометкаУдаленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПровестиРаспровестиНаСервере()
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Если (Объект.Проведен) Тогда
		Сообщить("Документ уже проведен");
		Возврат
	Иначе
		ОбъектДокумента.Дата = ТекущаяДата();
		ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровестиРаспровести(Команда)
	КомандаПровестиРаспровестиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменаПроведенияНаСервере()

	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Если (Объект.Проведен) Тогда
		ОбъектДокумента.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе
		Сообщить("Невозможно отменить проведение документа");
		Возврат		
	КонецЕсли; 
	
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведения(Команда)
	ОтменаПроведенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписьНаСервере()
	
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	Если Объект.проведен ИЛИ Объект.ПометкаУдаления  Тогда
		Сообщить("Невозможно записать документ");
		Возврат
	Иначе
		Записать();
	КонецЕсли; 
	
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Запись(Команда)
	ЗаписьНаСервере();
КонецПроцедуры




