
&НаКлиенте
Процедура ЗапуститьГенерацию1000ЭлементовНоменклатуры(Команда)
	ЗапуститьГенерацию1000ЭлементовНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьГенерацию1000ЭлементовНоменклатурыНаСервере()
	
	ГруппаТестовая = Справочники.Номенклатура.СоздатьГруппу();
	ГруппаТестовая.Наименование = "Тестовая номенклатура";
	ГруппаТестовая.Записать();
	
	Для Счетчик = 1 По 1000 Цикл
		ЭлементТестовый = Справочники.Номенклатура.СоздатьЭлемент();
		ЭлементТестовый.Родитель = ГруппаТестовая.Ссылка;
		ЭлементТестовый.Наименование = "Товар " + Счетчик;
		ЭлементТестовый.Записать();
	КонецЦикла;
	
КонецПроцедуры
