
&НаСервере
Процедура ЗаполнитьКалендарьНаСервере()
	
	ТекущаяДата = НачалоГода(ВведитеГод); 
	ОбрабатываемыйГод = Год(ВведитеГод);
	
	НЗ = РегистрыСведений.ПроизводственныйКалендарь.СоздатьНаборЗаписей();
	НЗ.Записать();
	
	Пока Год(ТекущаяДата) = ОбрабатываемыйГод Цикл
		НЗ = РегистрыСведений.ПроизводственныйКалендарь.СоздатьНаборЗаписей();
		НЗ.Отбор.ДатаКалендаря.Установить(ТекущаяДата);
		НЗ.Отбор.Год.Установить(ОбрабатываемыйГод); 
		
		НоваяЗапись = НЗ.Добавить();
		НоваяЗапись.ДатаКалендаря = ТекущаяДата;
		НоваяЗапись.Год = ОбрабатываемыйГод;
		НоваяЗапись.ДеньНедели = ДеньНедели(ТекущаяДата);
		НЗ.Записать(); 
		ТекущаяДата = ТекущаяДата + 60*60*24;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКалендарь(Команда)
	ЗаполнитьКалендарьНаСервере();
КонецПроцедуры
