
&НаКлиенте
Процедура ДобавитьЭлемент(Команда)
	ДобавитьЭлементНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементНаСервере()
	
	ЭлементСправочника = Справочники.ЮридическиеЛица.СоздатьЭлемент();
	ЭлементСправочника.Наименование = Наименование;
	ЭлементСправочника.ИНН = ИНН;
	ЭлементСправочника.ОфициальноеНаименование = ОфициальноеНаименование;
	ЭлементСправочника.ПочтовыйАдрес = ПочтовыйАдрес;
	ЭлементСправочника.ЮридическийАдрес = ЮридическийАдрес;
	
	Попытка
		ЭлементСправочника.Записать();
	Исключение
		Сообщить("Ошибка при записи элемента справочника ""Юридические лица""");
	КонецПопытки;
	
	
КонецПроцедуры
