
&НаСервере
Процедура ВывестиТаблицуНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяНоменклатура.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяНоменклатура.Количество КАК Количество,
		|	РасходнаяНакладнаяНоменклатура.Сумма КАК Сумма,
		|	РасходнаяНакладная.Филиал.Город КАК Город,
		|	РасходнаяНакладная.Филиал КАК Филиал,
		|	""Обычный товар"" КАК ТипПродажи
		|ИЗ
		|	Документ.РасходнаяНакладная.Номенклатура КАК РасходнаяНакладнаяНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|		ПО РасходнаяНакладнаяНоменклатура.Ссылка = РасходнаяНакладная.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаУцененногоТовараНоменклатура.Номенклатура,
		|	ПродажаУцененногоТовараНоменклатура.Количество,
		|	ПродажаУцененногоТовараНоменклатура.Сумма,
		|	ПродажаУцененногоТовара.Филиал.Город,
		|	ПродажаУцененногоТовара.Филиал,
		|	""Уцененный товар""
		|ИЗ
		|	Документ.ПродажаУцененногоТовара.Номенклатура КАК ПродажаУцененногоТовараНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаУцененногоТовара КАК ПродажаУцененногоТовара
		|		ПО ПродажаУцененногоТовараНоменклатура.Ссылка = ПродажаУцененногоТовара.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Свернуть("Город, Номенклатура", "Количество");
	ТаблицаПродаж.Загрузить(ТаблицаРезультат);
	

КонецПроцедуры

&НаКлиенте
Процедура ВывестиТаблицу(Команда)
	ВывестиТаблицуНаСервере();
КонецПроцедуры
