
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СтруктураДляОтчета) <> Тип("Структура") Тогда
		Сообщить("Неверный тип передаваемых данных");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	Заголовок = СтрШаблон("%1 %2", Параметры.СтруктураДляОтчета.Товар, Параметры.СтруктураДляОтчета.Филиал);
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ОбъектОтчет.ПолучитьМакет("МакетРасшифровки");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ТабДок.Вывести(ОбластьШапка);
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.СтруктураДляОтчета.АдресТаблицы);
	
	Для Каждого Строка из ТаблицаДанных Цикл
		ОбластьСтрока.Параметры.Заполнить(Строка);
		ОбластьСтрока.Параметры.СсылкаНаДокумент = Строка.Перемещение;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры
