
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БалансПодарочнойКарты Приход
	Движения.БалансПодарочнойКарты.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.БалансПодарочнойКарты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Филиал = Филиал;
		Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
		Движение.SN = ТекСтрокаСостав.SN;
		Движение.Сумма = ТекСтрокаСостав.Номинал;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
