
&НаСервере
Процедура ДобавитьЗаписьНаСервере()
	
	НЗ = РегистрыСведений.ЦеныНаУцененныйТовар.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор);
	НЗ.Прочитать();
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.SN = SN;
	НоваяЗапись.Товар = Товар;
	НоваяЗапись.Цена = Цена;
	НоваяЗапись.Период = Регистратор.Дата;
	НоваяЗапись.Регистратор = Регистратор;
	
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗапись(Команда)
	ДобавитьЗаписьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	УдалитьЗаписьНаСервере();
КонецПроцедуры
