
&НаСервере
Процедура ВывестиСотрудниковНаСервере()
	
	Таблица.Очистить();
	
	Об = РеквизитФормыВЗначение("Объект");
	Макет = Об.ПолучитьМакет("МакетСотрудники");
	
	МакетШапка = Макет.ПолучитьОбласть("Шапка");
	МакетРабочая = Макет.ПолучитьОбласть("РабочаяОбласть");
	
	МакетШапка.Параметры.ФИОДиректора = Справочники.Сотрудники.Директор;
	МакетШапка.Параметры.ДатаЗапретаРедактирования =  Константы.ДатаЗапретаРедактирования.Получить();
	МакетШапка.Параметры.ТекущаяСтавкаНДС =  Константы.ТекущаяСтавкаНДС.Получить();
	Таблица.Вывести(МакетШапка);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Филиал");
	ТаблицаДанных.Колонки.Добавить("Сотрудник");
	ТаблицаДанных.Колонки.Добавить("Год");
	
	Выборка = Справочники.Сотрудники.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаДанных.Добавить();
		СтрокаТаблицы.Филиал = Выборка.ФилиалРаботы;
		СтрокаТаблицы.Сотрудник = Выборка.Наименование;
		СтрокаТаблицы.Год = Год(Выборка.ДатаРождения);
	КонецЦикла;
	
	ТаблицаДанных.Сортировать("Филиал Убыв");
	
	Директор = Справочники.Сотрудники.Директор;
		
	Для каждого Строки из ТаблицаДанных Цикл
		Если Строки.Сотрудник <> Строка(Директор) Тогда
			МакетРабочая.Параметры.Филиал = Строки.Филиал;
			МакетРабочая.Параметры.Сотрудник = Строки.Сотрудник;
			МакетРабочая.Параметры.Год = Строки.Год;
			Таблица.Вывести(МакетРабочая);
		Иначе
			МакетРабочая.Параметры.Филиал = Строки.Филиал;
			МакетРабочая.Параметры.Сотрудник = Строки.Сотрудник;
			МакетРабочая.Параметры.Год = Строки.Год;
			МакетРабочая.Область(1,1,1,3).ЦветФона = WebЦвета.ЗеленоЖелтый;
			Таблица.Вывести(МакетРабочая);
			МакетРабочая.Область(1,1,1,3).ЦветФона = WebЦвета.Белый;
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСотрудников(Команда)
	ВывестиСотрудниковНаСервере();
КонецПроцедуры
