
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивОшибок = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		МассивОшибок.Добавить("Филиал не можен быть пустым");
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить(СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("Автор");
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиРаспровести()
	
	Если Не ПроверитьЗаполнение() ТОгда
		Возврат;
	КонецЕсли;
	ПровестираспровестинаСервере();
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.ОстаткиТовара.Очистить();
	
	Движения.ПродажаТовара.Записывать = Истина;
	Движения.ПродажаТовара.Очистить();
	
	Движения.Записать();
	
	
	
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ТекСтрокаНоменклатура.Номенклатура);
		Отбор.Вставить("Филиал",Филиал);
		
		ТаблицаОстаткиПоТовару = РегистрыНакопления.ОстаткиТовара.Остатки(МоментВремени(),Отбор);
		Если ТаблицаОстаткиПоТовару.Количество() > 0 И ТаблицаОстаткиПоТовару[0].Количество >= ТекСтрокаНоменклатура.Количество Тогда
			НоваяСтрокаОстатки = Движения.ОстаткиТовара.Добавить();
			НоваяСтрокаОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрокаОстатки.Период = Дата;
			НоваяСтрокаОстатки.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
			НоваяСтрокаОстатки.Филиал = Филиал; 
			НоваяСтрокаОстатки.Количество = ТекСтрокаНоменклатура.Количество;
			НоваяСтрокаОстатки.Сумма = ?(ТаблицаОстаткиПоТовару[0].Количество = ТекСтрокаНоменклатура.Количество, 
			ТаблицаОстаткиПоТовару[0].Сумма,
			ТаблицаОстаткиПоТовару[0].Сумма/ТаблицаОстаткиПоТовару[0].Количество*ТекСтрокаНоменклатура.Количество);
			
			НоваяЗаписьПродажи = Движения.ПродажаТовара.Добавить();
			НоваяЗаписьПродажи.Период = Дата;
			НоваяЗаписьПродажи.Номенклатура = ТекСтрокаНоменклатура.Номенклатура; 
			НоваяЗаписьПродажи.Филиал = Филиал;
			НоваяЗаписьПродажи.Количество = ТекСтрокаНоменклатура.Количество;
			НоваяЗаписьПродажи.СуммаПродажи = ТекСтрокаНоменклатура.Сумма;
			НоваяЗаписьПродажи.Себестоимость = НоваяСтрокаОстатки.Сумма;
			НоваяЗаписьПродажи.СостояниеТовараПриПродаже = Перечисления.СостояниеТовараПриПродаже.ПустаяСсылка();
			
		Иначе
			Сообщить(СтрШаблон("Недостаточно товара %1", ТекСтрокаНоменклатура.Номенклатура));
			Отказ = Истина;
			Возврат
		КонецЕсли;
	КонецЦикла;
		
	Движения.ОстаткиТовара.Записывать = Истина;
    Движения.ПродажаТовара.Записывать = Истина;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

