
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗаказанныеТовары.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ЗаказанныеТовары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = Ссылка;
		Движение.Филиал = ФилиалПоставки;
		Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
		Движение.Количество = ТекСтрокаСостав.Количество;
		Движение.Сумма = ТекСтрокаСостав.Сумма;
	КонецЦикла;
	
	КонецПроцедуры
