
Процедура Печать(ТабДок, МассивДокументов) Экспорт

	ВставитьРазделительСтраниц = Ложь;
Если (Ложь) Тогда
ТабДок = Новый ТабличныйДокумент;
КонецЕсли;

Для Каждого СсылкаНаДокумент из МассивДокументов Цикл
Если (ВставитьРазделительСтраниц) Тогда 
ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецЕсли;

Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");

ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

ОбластьЗаголовок.Параметры.Дата = СсылкаНаДокумент.Дата;
ОбластьЗаголовок.Параметры.НомерДокумента = СсылкаНаДокумент.Номер;

ОбластьШапка.Параметры.Заполнить(СсылкаНаДокумент);

ТабДок.Вывести(ОбластьЗаголовок);
ТабДок.Вывести(ОбластьШапка);
ТабДок.Вывести(ОбластьНоменклатураШапка);

Для Каждого СтрокаНоменклатура Из СсылкаНаДокумент.Номенклатура Цикл
ОбластьНоменклатура.Параметры.Заполнить(СтрокаНоменклатура);
ТабДок.Вывести(ОбластьНоменклатура);
КонецЦикла;

ОбластьПодвал.Параметры.Заполнить(СсылкаНаДокумент);
ТабДок.Вывести(ОбластьПодвал);

ВставлятьРазделительСтраниц = Истина;
КонецЦикла;

КонецПроцедуры
