
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбора = Элементы.ТипДокумента.СписокВыбора;
	СписокВыбора.Добавить("","Все документы");
	Для каждого ЭлементМетаданных из Метаданные.ЖурналыДокументов.ЖурналДокументыФормированияЦен.РегистрируемыеДокументы Цикл
		СписокВыбора.Добавить(СтрШаблон("ДокументСсылка.%1", ЭлементМетаданных.Имя), ЭлементМетаданных.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ТипДокументаПриИзмененииНаСервере()
	
	Если ПустаяСтрока(ТипДокумента) Тогда
		УстановитьОтборДинамическогоСписка(Список,"Тип",ВидСравненияКомпоновкиДанных.Равно,Ложь);
	Иначе
		УстановитьОтборДинамическогоСписка(Список,"Тип", ВидСравненияКомпоновкиДанных.Равно, Истина, Тип(ТипДокумента));
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ДинамическийСписок, ИмяКолонки, ВидСравнения, Использование = Истина, ЗначениеОтбора = Неопределено)
	
	ПолеКомпановкиВладелец = Новый ПолеКомпоновкиДанных(ИмяКолонки);
	
	Для каждого ЭлементОтбора из ДинамическийСписок.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпановкиВладелец И ЭлементОтбора.ВидСравнения = ВидСравнения Тогда
			ЭлементОтбора.Использование = Использование;
			Если Использование и ЭлементОтбора.ПравоеЗначение <> ЗначениеОтбора Тогда
				ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = ПолеКомпановкиВладелец ;
	ЭлементОтбора.ВидСравнения = ВидСравнения ;
	ЭлементОтбора.Использование = Использование;
	ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ТипДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
