
 &НаКлиенте
 Процедура Команда1(Команда)
 	

 КонецПроцедуры


&НаКлиенте
 Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	 
	 СтандартнаяОбработка = Ложь;
	 ПолчитьИЗВХ(ДанныеРасшифровки,Расшифровка);
	 
 КонецПроцедуры


&НаСервере
 Процедура ПолчитьИЗВХ(Адрес,Расшифровка)
	 
	 ВРЕМЕ = ПолучитьИзВременногоХранилища(Адрес);
	 Поле = ВРЕМЕ.Элементы[Расшифровка].ПолучитьРодителей();
 КонецПроцедуры


&НаКлиенте
 Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	 // Вставить содержимое обработчика.
 КонецПроцедуры
 