
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивОшибок = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		МассивОшибок.Добавить("Филиал не можен быть пустым");
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить(СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("Автор");
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиРаспровести()
	
	Если Не ПроверитьЗаполнение() ТОгда
		Возврат;
	КонецЕсли;
	ПровестираспровестинаСервере();
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)  
	
	Автор = Неопределено;
	Контрагент = Неопределено;
	Дата = ТекущаяДата();
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УценкаТовара") Тогда
		// Заполнение шапки
		Автор = ДанныеЗаполнения.Автор;
		Склад = ДанныеЗаполнения.Склад;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Филиал = ДанныеЗаполнения.Филиал;
		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Номенклатура.Добавить();
			НоваяСтрока.SN = ТекСтрокаСостав.SN;
			НоваяСтрока.Цена = ТекСтрокаСостав.НоваяЦена;
			НоваяСтрока.Номенклатура = ТекСтрокаСостав.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

