
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗаполнениеИзОбработки Тогда
		
		ОбъектДокумента = РеквизитФормыВЗначение("Объект");
		ОбъектДокумента.Дата=ТекущаяДата();
		
		Если Параметры.Филиал.Количество() = 1 Тогда  
			ОбъектДокумента.ФилиалПоставки = Параметры.Филиал[0].Значение;
		КонецЕсли;
		
		ТабЧасть = ПолучитьИзВременногоХранилища(Параметры.Адрес); 
		Для каждого Строка из ТабЧасть Цикл
			СтрокаТабЧасти = ОбъектДокумента.Состав.Добавить();
			СтрокаТабЧасти.Номенклатура = Строка.Номенклатура;
			СтрокаТабЧасти.Количество = Строка.Количество; 
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЦенаИЛИКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	КонецЕсли;
	ПересчитатьСуммуДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Состав.Итог("Сумма");
	
КонецПроцедуры
