

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СтруктураДляОтчета) <> Тип("Структура") Тогда
		Сообщить("Неверный тип передаваемых данных");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	Заголовок = Параметры.СтруктураДляОтчета.Филиал.Наименование + " - " + Параметры.СтруктураДляОтчета.Автор ;
	
	МакетПродажиСотрудника = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ПродажиСотрудника");
	Результат.Очистить();
	ОбластьШапка = МакетПродажиСотрудника.ПолучитьОбласть("Шапка");
	ОбластьСтрока = МакетПродажиСотрудника.ПолучитьОбласть("Строка");
	ОбластьИтог = МакетПродажиСотрудника.ПолучитьОбласть("Подвал");
	Результат.Вывести(ОбластьШапка);
	
	СуммаИтог = 0;
	
	Для каждого СтруктураДанных Из Параметры.СтруктураДляОтчета Цикл
		ДанныеСтруктуры = СтруктураДанных.Значение; 
		Если ТипЗнч(ДанныеСтруктуры) = Тип("Структура") Тогда
			ОбластьСтрока.Параметры.Заполнить(ДанныеСтруктуры);
			СуммаИтог = СуммаИтог + ДанныеСтруктуры.Продажи;
			Результат.Вывести(ОбластьСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ОбластьИтог.Параметры.Сумма = СуммаИтог;
	Результат.Вывести(ОбластьИтог);
	
КонецПроцедуры 


