
&НаСервере
Процедура СохранитьНаСервере()
	
	Если МесяцДействия = '00010101' Тогда
		Дата = ТекущаяДата();
	Иначе
		Дата = МесяцДействия;
	КонецЕсли;
	
	Для Каждого Строка Из ТабЧасть Цикл
		МЗ = РегистрыСведений.МинимальныйОстатокТовараНаФилиале.СоздатьМенеджерЗаписи();
		МЗ.Период = Дата;
		МЗ.Номенклатура = Строка.Номенклатура;
		МЗ.Филиал = Филиал;
		МЗ.Количество = Строка.МинимальныйОстаток;
		МЗ.ДатаЗаписи = Дата;
		МЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТабЧасть.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Товар
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварНаФилиале.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(МинимальныйОстатокТовараНаФилиалеСрезПоследних.Количество, 0) КАК МинимальныйОстаток
	|ИЗ
	|	ВТ_Товар КАК ВТ_ТоварНаФилиале
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныйОстатокТовараНаФилиале.СрезПоследних(, Филиал = &Филиал) КАК МинимальныйОстатокТовараНаФилиалеСрезПоследних
	|		ПО ВТ_ТоварНаФилиале.Ссылка = МинимальныйОстатокТовараНаФилиалеСрезПоследних.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура");
	
	Запрос.УстановитьПараметр("Филиал",Филиал);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	
	ТаблицаОстатка = Запрос.Выполнить().Выгрузить();
	
	ТабЧасть.Загрузить(ТаблицаОстатка);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Филиал) Тогда
		Сообщить("Выберите филиал");
		Возврат
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалИлиДатаПриИзменении(Элемент)
	
	Если ТабЧасть.Количество() <> 0 Тогда 
		
		Оповещение = Новый ОписаниеОповещения("ОчисткаТаблицы",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Очистить табличную часть?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОчисткаТаблицы (Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ТабЧасть.Очистить();
	КонецЕсли;
	
	Возврат
	
КонецПроцедуры