
&НаКлиенте
Процедура ЗаписатьКонстанту(Команда)
	ЗаписатьКонстантуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстантуНаСервере()
	
	ДатаЗапретаТекущая = Константы.ДатаЗапретаРедактирования.Получить();
	Если ДатаЗапретаТекущая <> РеквизитДатаЗапрета Тогда
		Константы.ДатаЗапретаРедактирования.Установить(РеквизитДатаЗапрета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКонстанту(Команда)
	ПолучитьКонстантуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКонстантуНаСервере()
	
	ДатаЗапретаРедактирования = Константы.ДатаЗапретаРедактирования.Получить();
	РеквизитДатаЗапрета = ДатаЗапретаРедактирования;
	Сообщить(ДатаЗапретаРедактирования);
	
КонецПроцедуры
