
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Результат = Ложь;	
	
	Для каждого Элемент ИЗ Состав Цикл
		РезультатПроверки = ПроверкаСН(Элемент.SN);
		Если РезультатПроверки.Проверка Тогда
			Элемент.SN = "";
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Отказ = Результат;
	
	Если Сумма > Состав.Итог("Номинал") Тогда
		Сообщить("Нехватает средств на картах");
		Отказ = Истина;
	КонецЕсли;
	
	ОстатокСуммы = 0;
	Движения.БалансПодарочнойКарты.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		
		Движение = Движения.БалансПодарочнойКарты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Филиал = Филиал;
		Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
		Движение.SN = ТекСтрокаСостав.SN;
		
		ТекущаяСумма = ТекСтрокаСостав.СуммаСписания + ОстатокСуммы;  
		Если ТекущаяСумма > ТекСтрокаСостав.Номинал Тогда
			ОстатокСуммы = ОстатокСуммы + ТекСтрокаСостав.СуммаСписания - ТекСтрокаСостав.Номинал;	
			Движение.Сумма = ТекСтрокаСостав.Номинал;
		Иначе
			Движение.Сумма = ТекущаяСумма;
			ОстатокСуммы = 0;
		КонецЕсли;
	КонецЦикла;
                                 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	
КонецПроцедуры 

&НаСервере
Функция ПроверкаСН(СН)  
	
	СтруктураСН = Новый Структура;
	ЗапросСН = Новый Запрос("ВЫБРАТЬ
	|	БалансПодарочнойКарты.Номенклатура КАК Номенклатура,
	|	БалансПодарочнойКарты.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.БалансПодарочнойКарты КАК БалансПодарочнойКарты
	|ГДЕ
	|	БалансПодарочнойКарты.SN = &SN");
	
	ЗапросСН.УстановитьПараметр("SN",СН);
	
	ТаблицаСН = ЗапросСН.Выполнить().Выгрузить();
	Если ТаблицаСН.Количество() > 1 Тогда
		Сообщить("Продажа по этой карте уже проводилась");
		СтруктураСН.Вставить("Проверка",Истина);
		Возврат СтруктураСН
	ИначеЕсли ТаблицаСН.Количество() = 0 Тогда
		Сообщить("Карты не найдено");
		СтруктураСН.Вставить("Проверка",Истина);
		Возврат СтруктураСН
	Иначе
		СтрокаТЗ = ТаблицаСН[0];
		СтруктураСН.Вставить("Проверка",Ложь);
		СтруктураСН.Вставить("Номенклатура",СтрокаТЗ.Номенклатура);
		СтруктураСН.Вставить("Номинал",СтрокаТЗ.Сумма);
		Возврат СтруктураСН
	КонецЕсли;
	
КонецФункции
