
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СтруктураДляОтчета) <> Тип("Структура") Тогда
		Сообщить("Неверный тип передаваемых данных");
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	Заголовок = Параметры.СтруктураДляОтчета.Филиал;
	Филиал = Параметры.СтруктураДляОтчета.Филиал;
	ДатаС = Параметры.СтруктураДляОтчета.ДатаС;
	ДатаПо = Параметры.СтруктураДляОтчета.ДатаПо;
	Товар = Параметры.СтруктураДляОтчета.Товар;
	
	СформироватьОтчет()
	
КонецПроцедуры


&НаСервере
Процедура СформироватьОтчет()
	
	ТабДок.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПродажаТовараОбороты.Номенклатура КАК ГруппаТовара,
	|	СУММА(ПродажаТовараОбороты.СуммаПродажиОборот) КАК СуммаПродажи,
	|	СУММА(ПродажаТовараОбороты.СебестоимостьОборот) КАК Себестоимость,
	|	СУММА(ПродажаТовараОбороты.СуммаПродажиОборот) - СУММА(ПродажаТовараОбороты.СебестоимостьОборот) КАК ВаловаяПрибыль,
	|	СУММА(ПродажаТовараОбороты.КоличествоОборот) КАК КоличествоПродано,
	|	ПродажаТовараОбороты.Филиал КАК Филиал
	|ИЗ
	|	РегистрНакопления.ПродажаТовара.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			Регистратор,
	|			Номенклатура = &Номенклатура
	|				И Филиал = &Филиал) КАК ПродажаТовараОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажаТовараОбороты.Номенклатура,
	|	ПродажаТовараОбороты.Филиал");
	
	Запрос.УстановитьПараметр("Филиал", ЭтотОбъект.Филиал);
	Запрос.УстановитьПараметр("Дата1",  ЭтотОбъект.ДатаС);
	Запрос.УстановитьПараметр("Дата2", ЭтотОбъект.ДатаПо);
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Товар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетРасшифровки");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	
	ЭтотОбъект.ТабДок.Вывести(ОбластьШапка);
	
	Если Выборка.Следующий() Тогда
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ЭтотОбъект.ТабДок.Вывести(ОбластьСтрока);
	КонецЕсли;
	
КонецПроцедуры
