
&НаСервере
Процедура ДобавитьСотрудникаНаСервере()
	
	ЭлементСправочника = Справочники.Сотрудники.СоздатьЭлемент();
	ЭлементСправочника.УстановитьНовыйКод();
	ЭлементСправочника.Наименование = Фамилия + " " + Имя + " " + Отчество;
	ЭлементСправочника.Фамилия = Фамилия;
	ЭлементСправочника.Имя = Имя;
	ЭлементСправочника.Отчество = Отчество;
	ЭлементСправочника.ДатаРождения = ДатаРождения;
	ЭлементСправочника.ФилиалРаботы = ФилиалРаботы;
	
	Попытка
		ЭлементСправочника.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудника(Команда)
	ДобавитьСотрудникаНаСервере();
КонецПроцедуры
