
&НаСервере
Процедура СформироватьНаСервере()
	
	ТЗ.Очистить();
	
	ЗапросНоменклатуры = Новый Запрос("ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходнаяНакладнаяНоменклатура.Номенклатура КАК Номенклатура,
	|		СУММА(РасходнаяНакладнаяНоменклатура.Количество) КАК Количество
	|	ИЗ
	|		Документ.РасходнаяНакладная.Номенклатура КАК РасходнаяНакладнаяНоменклатура
	|	ГДЕ
	|		РасходнаяНакладнаяНоменклатура.Ссылка.Проведен
	|		%УсловиеПериода%
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходнаяНакладнаяНоменклатура.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПродажаУцененногоТовараНоменклатура.Номенклатура,
	|		СУММА(ПродажаУцененногоТовараНоменклатура.Количество)
	|	ИЗ
	|		Документ.ПродажаУцененногоТовара.Номенклатура КАК ПродажаУцененногоТовараНоменклатура
	|	ГДЕ
	|		ПродажаУцененногоТовараНоменклатура.Ссылка.Проведен
	|		%УсловиеПериода2%
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПродажаУцененногоТовараНоменклатура.Номенклатура) КАК ВложенныйЗапрос
	|
	|		%УсловиеТовара%
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура");
	
	Если ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст,"%УсловиеПериода%","И РасходнаяНакладнаяНоменклатура.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2");
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст,"%УсловиеПериода2%","И ПродажаУцененногоТовараНоменклатура.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2");
		ЗапросНоменклатуры.УстановитьПараметр("Дата1", Период.ДатаНачала);
		ЗапросНоменклатуры.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	Иначе
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст,"%УсловиеПериода%","");
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст,"%УсловиеПериода2%","");
	КонецЕсли;
	
	Если Товар.Количество() > 0 Тогда
		СтрокаЗамены = "ГДЕ ";
		счетчик = 1;
		Для каждого Значения Из Товар Цикл 
			СтрокаЗамены = СтрокаЗамены + "ВложенныйЗапрос.Номенклатура = &Товар" + счетчик + " ИЛИ ";
			ЗапросНоменклатуры.УстановитьПараметр("Товар" + счетчик, Значения.Значение);
			счетчик = счетчик + 1;
		КонецЦикла;
		СтрокаЗамены = Лев(СтрокаЗамены,СтрДлина(СтрокаЗамены) - 4);
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст,"%УсловиеТовара%",СтрокаЗамены);
	Иначе
		ЗапросНоменклатуры.Текст = СтрЗаменить(ЗапросНоменклатуры.Текст,"%УсловиеТовара%","");
	Конецесли;
	
	ТаблицаНоменклатуры = ЗапросНоменклатуры.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Строка.Номенклатура;
		СтрокаТЗ.КоличествоПроданного = Строка.Количество;
		СтрокаТЗ.КоличествоДляЗаказа = Цел(Строка.Количество * Коэффициент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
