
&НаСервере
Процедура СформироватьНаСервере()
	
	
		
	ТЗ.Очистить();
	
	
	ЗапросНоменклатуры = Новый Запрос("ВЫБРАТЬ
	                                  |	РасходнаяНакладнаяНоменклатура.Номенклатура КАК Номенклатура,
	                                  |	СУММА(РасходнаяНакладнаяНоменклатура.Количество) КАК Количество
	                                  |ИЗ
	                                  |	Документ.РасходнаяНакладная.Номенклатура КАК РасходнаяНакладнаяНоменклатура
	                                  |ГДЕ
	                                  |	РасходнаяНакладнаяНоменклатура.Ссылка.Проведен
	                                  |	И РасходнаяНакладнаяНоменклатура.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	РасходнаяНакладнаяНоменклатура.Номенклатура
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ПродажаУцененногоТовараНоменклатура.Номенклатура,
	                                  |	СУММА(ПродажаУцененногоТовараНоменклатура.Количество)
	                                  |ИЗ
	                                  |	Документ.ПродажаУцененногоТовара.Номенклатура КАК ПродажаУцененногоТовараНоменклатура
	                                  |ГДЕ
	                                  |	ПродажаУцененногоТовараНоменклатура.Ссылка.Проведен
	                                  |	И ПродажаУцененногоТовараНоменклатура.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ПродажаУцененногоТовараНоменклатура.Номенклатура");
	
	ЗапросНоменклатуры.УстановитьПараметр("Дата1", Период.ДатаНачала);
	ЗапросНоменклатуры.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	
	ТаблицаНоменклатуры = ЗапросНоменклатуры.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Строка.Номенклатура;
		СтрокаТЗ.КоличествоПроданного = Строка.Количество;
		СтрокаТЗ.КоличествоДляЗаказа = Цел(Строка.Количество * Коэффициент);
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Коэффициент) ИЛИ НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Сообщить("Данные не заполнены");
		Возврат
	КонецЕсли;

	СформироватьНаСервере();
КонецПроцедуры
