
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МассивСН = Новый Массив;
	Для Каждого СН из Объект.Состав Цикл
		МассивСН.Добавить(СН.SN);
	КонецЦикла;
	
	Отказ = ПроверкаSN(МассивСН);
	
КонецПроцедуры

&НаСервере
Функция ПроверкаSN(МассивСН)
	
	МассивДляУдаления = Новый Массив;
	Для каждого SN из МассивСН Цикл
		Выборка = Документы.ПродажаПодарочнойКарты.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Номер <> Объект.Номер Тогда
				Для каждого Серийник Из Выборка.Состав Цикл
					Если Серийник.SN = SN Тогда
						Отбор = Новый Структура("SN",SN);
						Строка = Объект.Состав.НайтиСтроки(Отбор);
						МассивДляУдаления.Добавить(Строка[0]);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если МассивДляУдаления.Количество() = 0 Тогда
		Возврат Ложь
	Иначе
		Для каждого СтрокаНоменклатуры из МассивДляУдаления Цикл 
			СтрокаНоменклатуры.SN = "";
		КонецЦикла;
		Сообщить("SN уже существует в другом документе");
		Возврат Истина
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоставSNПриИзменении(Элемент)
	
	ТекущиеДан = Элементы.Состав.ТекущиеДанные;
	Для Каждого Строка из Объект.Состав Цикл
		Если Строка.SN = ТекущиеДан.SN И ТекущиеДан.НомерСтроки <> Строка.НомерСтроки Тогда
			Сообщить("Данный SN уже существует");
			ТекущиеДан.SN = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
